# DetailLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..DetailLevel Property
OverrideGraphicSettings Class See Also
---
The detail level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ViewDetailLevel DetailLevel { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DetailLevel As ViewDetailLevel
	Get
```

Visual C++
---
```text
public:
property ViewDetailLevel DetailLevel {
	ViewDetailLevel get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace